[
  {
    "title": "Мессенджер Павла Дурова Telegram получил новые полезные функции",
    "body": "Редактирование сообщений\nВносить изменения в сообщения, отправленные в Telegram, можно в течение двух дней после их создания. Функция доступна в новых версиях приложений для Android и iOS, а также в десктопном варианте.\nВ мобильных приложениях для редактирования сообщения нужно коснуться его. В результате появится меню, в котором нужно выбрать пункт «Edit» («Редактировать»).\nВ версии для ПК редактирование вызывается нажатием на кнопку со стрелкой. После редактирования в обоих случаях над сообщением появится иконка «edited» («отредактировано»).",
    "image": "https://htstatic.imgsmail.ru/pic_image/0da88dff8c70e8be40a9c52f3d5916ab/1920/-/1215432/",
    "source": "hi-tech.mail.ru",
    "type": 0
  },
  {
    "title": "Ученый объяснил, почему во Вселенной не могут существовать разумные роботы",
    "body": "Зонды фон Неймана\nДжон фон Нейман создал теорию существования самовоспроизводящихся машин (зонды фон Неймана). Эти роботы представляют собой искусственный интеллект. Они способны сами перемещаться, размножаться и эволюционировать. В теории такие роботы могут заполонить всю Вселенную путем самокопирования за полмиллиона лет.\nОни могут использоваться для исследования Вселенной, передачи информации на огромные расстояния, а также для добычи полезных ископаемых.",
    "image": "https://htstatic.imgsmail.ru/pic_image/be7a93db688fa020a5232b9c6590c531/1920/-/1215426/",
    "source": "hi-tech.mail.ru",
    "type": 2
  },
  {
    "title": "Создана программа, которая делает из кино картины великих художников",
    "body": "Кадры – в полотна\nНейронная сеть – система искусственного интеллекта, которая обладает способностью распознавать даже серьезно искаженные сигналы, причем качество распознавания повышается в процессе обучения. Для раскрашивания видео использовалась «глубокая» нейронная сеть с несколькими слоями абстракции и обработки информации.\nАлексей Досовицкий из университета Фрайбурга (Германия), один из создателей программы, рассказал, что первый слой нейросети используется для анализа картин художника. Он извлекает из полотен информацию об используемых красках, мазках, стиле.\nВторой слой анализирует кадры фильма. Он распознает объекты и фактически превращает их в эскизы будущих картин.",
    "image": "http://lorempixel.com/400/200/",
    "source": "hi-tech.mail.ru",
    "type": 0
  },
  {
    "title": "Популярное приложение для бега шпионит за пользователями",
    "body": "Приложение для занятий бегом\nRunKeeper – это сервис для отслеживания тренировок пользователей, занимающихся бегом, ходьбой, велоспортом и другими дисциплинами. Приложение фиксирует траекторию перемещения с помощью данных GPS. RunKeeper используют 45 миллионов спортсменов со всего мира.\nНарушение закона\nОднако, как выяснилось, RunKeeper продолжает собирать информацию о местоположении пользователей в фоновом режиме даже после тренировок. Эти сведения передаются рекламодателям для выдачи более релевантной контекстной рекламы.\nЭто прямое нарушение европейского закона о защите данных. Также постоянная работа GPS в фоновом режиме может негативно влиять на время работы устройства от одного заряда аккумулятора.\nНо Совет потребителей Норвегии никак не может повлиять на FitnessKeeper, так как это американская компания. На данный момент совет ожидает ответа на жалобу от разработчиков приложения.",
    "image": "https://htstatic.imgsmail.ru/pic_image/d3cd44d0e9c6b63d298e92dec951bc31/1920/-/1215420/",
    "source": "hi-tech.mail.ru",
    "type": 0
  },
  {
    "title": "Беспроводной робот удалил проглоченную батарейку из желудка",
    "body": "Крошечный и точный\nРобота поместили внутрь макета человеческого желудка и пищевода, заполненного водным раствором лимонной кислоты. Разработчики отмечают, что капсула реального робота для проведения хирургических операций будет сделана не изо льда, а из биосовместимого полимера, который будет растворяться желудочным соком.\nУстройство смогло самостоятельно покинуть ледяную капсулу и активироваться в нужном месте. Там оно с помощью магнита захватило батарейку (по легенде, она якобы была проглочена) и переместило её к выходу из модели.",
    "image": "https://htstatic.imgsmail.ru/pic_image/669710f41deeebc65378e659dc5d73b4/1920/-/1215419/",
    "source": "hi-tech.mail.ru",
    "type": 1
  }
]
